{
    "title": "Пробуждение Тени",
    "chapters": {
        "Глава 1": {
            "start": {
                "text": "Ты просыпаешься в кромешной тьме. Стены здесь пахнут старой бумагой и металлом. В голове пустота, словно кто-то стер часы и карты. Ты помнишь обрывки: звук моря, чей-то смех и вагоны, грохочущие по мосту. Но основной момент — дверь перед тобой. Она закрыта, и из-под неё пробивается тонкий холодный свет. Пол под ногами скрипит, и где-то далеко течёт вода.\n\nТы пробуешь встать. Сначала тело отзывается тяжело. Руки находят прохладную поверхность стола. На столе — ключ, сложенная бумага и металлический цилиндрок с выгравированными линиями, похожими на карту.\n\nВыбери действие.",
                "buttons": {
                    "inspect_table": {
                        "text": "Осмотреть стол",
                        "next": "inspect_table"
                    },
                    "open_door": {
                        "text": "Подойти к двери",
                        "next": "open_door"
                    },
                    "read_note": {
                        "text": "Развернуть бумагу",
                        "next": "read_note"
                    },
                    "sleep_again": {
                        "text": "Попробовать заснуть",
                        "next": "sleep_again"
                    }
                }
            },
            "inspect_table": {
                "text": "Стол старый, с потёртой поверхностью. На нём: ключ из тяжёлого металла, бумага с небрежным почерком, цилиндрок, который кажется весит больше, чем выглядит. На бумаге набросан символ — круг с тремя разомкнутыми лучами. Внутри круга маленький крест. Почерк дрожащий, как у человека, пишущего вбег. Внизу маркером дописано: «Не доверяй свету».\n\nЦилиндрок при взгляде вызывает странное ощущение: будто внутри чего-то движется и в то же время всё застывает. Ключ холодный на ощупь. Что делать?",
                "buttons": {
                    "take_key": {
                        "text": "Взять ключ",
                        "next": "take_key"
                    },
                    "examine_cylinder": {
                        "text": "Пощупать цилиндр",
                        "next": "examine_cylinder"
                    },
                    "read_note_again": {
                        "text": "Перечитать бумагу",
                        "next": "read_note"
                    },
                    "leave_table": {
                        "text": "Отойти от стола",
                        "next": "open_door"
                    }
                }
            },
            "take_key": {
                "text": "Ключ в твоей ладони ощущается как обещание. Вес, тонкая вибрация. На кольце ключа выгравирована буква, напоминающая латинскую 'S', но более искривлённая. Когда ты поднимаешь ключ, из темноты раздаётся тихий шорох, как будто кто-то переставил ногу. Сердце бьётся быстрее.\n\nВыбери следующий шаг.",
                "buttons": {
                    "try_key_on_door": {
                        "text": "Попробовать открыть дверь ключом",
                        "next": "try_key_on_door"
                    },
                    "hide_key": {
                        "text": "Спрятать ключ в одежде",
                        "next": "hide_key"
                    },
                    "inspect_cylinder": {
                        "text": "Исследовать цилиндр",
                        "next": "examine_cylinder"
                    }
                }
            },
            "examine_cylinder": {
                "text": "Цилиндр холоднее, чем ключ. На нем тонкие насечки, которые складываются в карту, если смотреть под правильным углом. Ты поворачиваешь цилиндр. Внутри слышен едва уловимый стук, как далёкий метроном. На торце — отверстие, размером под тонкую металлическую иглу.\n\nВдруг цилиндр начинает тихо вращаться в твоих руках. В воздухе появляется запах озона. Ты чувствуешь, что это не просто предмет. Решение предстоит быстрое.",
                "buttons": {
                    "insert_cylinder_into_wall": {
                        "text": "Попробовать вставить цилиндр в стену рядом с дверью",
                        "next": "insert_cylinder_into_wall"
                    },
                    "put_back": {
                        "text": "Положить цилиндр обратно",
                        "next": "inspect_table"
                    },
                    "break_cylinder": {
                        "text": "Разломать цилиндр",
                        "next": "break_cylinder"
                    }
                }
            },
            "read_note": {
                "text": "Бумага тонка и истончается по краям. На ней записано: «Если видишь тень — не смотри в неё. Тень питается памятью. Оставь одно воспоминание, и тень уйдёт на время. Не позволяй ей увидеть красное небо.» Подпись размазана, как будто писавший плакал.\n\nСлова отзываются внутри тебя знакомым эхом. Ты пытаешься вспомнить: был ли у тебя такое воспоминание? Воспоминания приходят фрагментами: дом и стальной мост, рука, которой ты держался в темноте, и лицо, которого ты не помнишь до конца.\n\nВыбери действие.",
                "buttons": {
                    "memorize_memory": {
                        "text": "Вспомнить одно яркое воспоминание",
                        "next": "memorize_memory"
                    },
                    "ignore_note": {
                        "text": "Игнорировать записку",
                        "next": "open_door"
                    },
                    "tear_note": {
                        "text": "Порвать бумагу",
                        "next": "tear_note"
                    }
                }
            },
            "sleep_again": {
                "text": "Ты закрываешь глаза. Сон приходит не как отдых, а как другое помещение в комнате: влажный, с запахом соли и железа. Во сне ты видишь вещи, которых не было. Ты оказываешься на палубе корабля, и над тобой небо небо — красное, разорванное. Со звуком разрывается стекло реальности. Ты просыпаешься, дрожа. Это только сон, но странный.\n\nКонец сцены. Что дальше?",
                "buttons": {
                    "get_up": {
                        "text": "Встать и осмотреться",
                        "next": "inspect_table"
                    },
                    "call_for_help": {
                        "text": "Закричать",
                        "next": "call_for_help"
                    }
                }
            },
            "try_key_on_door": {
                "text": "Ключ входит туго и затем с тихим щелчком поворачивается. Дверь приоткрывается на узкую щелку. Из коридора веет холодом и запахом сырого камня. Где-то вдалеке слышится повторяющийся стук — шаги, но не человеческие. На пороге лежит шнур из потайного материала, ведёт налево.\n\nВыбор за тобой.",
                "buttons": {
                    "peer_into_corridor": {
                        "text": "Посмотреть в коридор",
                        "next": "peer_into_corridor"
                    },
                    "close_door_back": {
                        "text": "Закрыть дверь и изучить комнату дальше",
                        "next": "inspect_table"
                    },
                    "take_key_and_leave": {
                        "text": "Взять ключ и выйти в коридор",
                        "next": "enter_corridor"
                    }
                }
            },
            "peer_into_corridor": {
                "text": "Коридор узкий. Стены влажные. Свет пробивается далеко вперед, а рядом с полом — глубокая тень, которую лучше не замечать. По стенам развешаны старые фотографии, покрытые паутиной. На некоторых лицах глаза вырезаны, оставлены лишь пустые кольца. Это вызывает неприятное ощущение, как будто кто-то присматривает за тобой.\n\nТы видишь две тропы: налево — вниз по лестнице, направо — через низкий проём в просторную камеру, где что-то мигает. Где идти?",
                "buttons": {
                    "go_left": {
                        "text": "Вниз по лестнице",
                        "next": "staircase_down"
                    },
                    "go_right": {
                        "text": "Через проём в камеру",
                        "next": "enter_chamber"
                    },
                    "go_back_in": {
                        "text": "Вернуться в комнату и закрыть дверь",
                        "next": "inspect_table"
                    }
                }
            },
            "enter_corridor": {
                "text": "Ты выходишь в коридор. Воздух режет кожу. Твои шаги отдаются эхом, но что-то ещё шепчет в темноте. На земле — следы, пахнущие ржавчиной. Следы ведут в сторону лестницы.\n\nТы слышишь, как вдалеке кто-то зовёт по имени, но голос обрывается. Тень у стены дрогнула. Решайся.",
                "buttons": {
                    "follow_traces": {
                        "text": "Идти по следам",
                        "next": "follow_traces"
                    },
                    "call_back": {
                        "text": "Окликнуть голос",
                        "next": "call_back"
                    }
                }
            },
            "staircase_down": {
                "text": "Лестница ведёт в подвал. По пути ты находишь дверь с замком, на котором тот же символ, что и на бумаге. Рядом на полу — отпечаток руки, словно кто-то торопливо ускользнул. Воздух здесь плотный. Ты ощущаешь, что спускаешься куда-то важное.\n\nПродолжай или возвращайся?",
                "buttons": {
                    "descend_further": {
                        "text": "Идти вниз",
                        "next": "deep_cellar"
                    },
                    "return_to_corridor": {
                        "text": "Вернуться в коридор",
                        "next": "peer_into_corridor"
                    }
                }
            },
            "enter_chamber": {
                "text": "Камера велика и кругла. В центре — странный круг, начерченный на полу, словно древняя диаграмма. Внутри круга лежат предметы: старый фотоаппарат, бутылка с мутным содержимым, выцарапанная игрушка. На стенах написаны даты и имена.\n\nВ центре круга на полке — книга. Когда ты подходишь, тени в углах сжимаются. Книга тяжёлая. На обложке нет букв, только тот самый знак. Открыть?",
                "buttons": {
                    "open_book": {
                        "text": "Открыть книгу",
                        "next": "open_book"
                    },
                    "take_items": {
                        "text": "Взять предметы и уйти",
                        "next": "take_items"
                    },
                    "step_into_circle": {
                        "text": "Встать в центр круга",
                        "next": "step_into_circle"
                    }
                }
            },
            "open_book": {
                "text": "Книга пахнет плесенью и морем. Страницы полны заметок, как дневник. Первая запись гласит: «Мы нуждаемся в памяти чтобы удержать их. Мы продаём свои сны, чтобы купить свет. Но свет — вор». Читая дальше, ты натыкаешься на страницу, где перечислены имена и даты. Одно из имен похоже на твоё, но с опечаткой.\n\nЧтение меняет атмосферу. Тень у стены движется ближе. Что делать?",
                "buttons": {
                    "copy_name": {
                        "text": "Запомнить имя из книги",
                        "next": "copy_name"
                    },
                    "close_book": {
                        "text": "Закрыть книгу и уйти",
                        "next": "enter_chamber"
                    },
                    "burn_page": {
                        "text": "Сжечь страницу",
                        "next": "burn_page"
                    }
                }
            },
            "step_into_circle": {
                "text": "Как только ты ступаешь в круг, мир дрогнул. В умах всплыли чужие лица и чужие страхи. У тебя появилась способность видеть слабые швы реальности. Тени перестали быть пустотой. Они стали порталом к фрагментам чужих жизней.\n\nТы видишь кусочек: ребенок у колодца, старик, отпускающий лодку, женщина, закрывающая окно перед рассветом. Видения быстро сменяют друг друга. Это опасно. Действуй.",
                "buttons": {
                    "leave_circle": {
                        "text": "Выйти из круга",
                        "next": "enter_chamber"
                    },
                    "push_deeper": {
                        "text": "Остаться и смотреть дальше",
                        "next": "vision_deep"
                    }
                }
            },
            "vision_deep": {
                "text": "Видения углубляются. Ты узнаёшь отрывок, где держал чужую руку и обещал не уходить. Обещание застревает в груди. Тень приближается, лаская память. Она требует плату: одно воспоминание. Ты должен выбрать, что отдать.\n\nВыбери воспоминание, которое готов потерять: лицо, имя, момент радости, или первый язык детства.",
                "buttons": {
                    "give_face": {
                        "text": "Отдать лицо (имена останутся)",
                        "next": "give_face"
                    },
                    "give_name": {
                        "text": "Отдать имя (лицо останется пустым)",
                        "next": "give_name"
                    },
                    "give_joy": {
                        "text": "Отдать момент радости",
                        "next": "give_joy"
                    },
                    "give_language": {
                        "text": "Отдать язык детства",
                        "next": "give_language"
                    }
                }
            },
            "give_face": {
                "text": "Ты чувствуешь, как контуры знакомых людей стираются. Их лица становятся размытыми масками. Мир холодеет. Тень отступает, шепчет благодарность. Ты теряешь способность узнавать людей по лицу. Это облегчит путь, но оставит пустоту.\n\nКонец сцены. Следующая глава ждёт.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 2",
                        "next": "Глава 2:start"
                    }
                }
            },
            "give_name": {
                "text": "Имя исчезает, как слово, выветрившееся из воздуха. Когда люди зовут тебя, ты не отвечаешь сразу — звук не совпадает с тем, что раньше было твоим. Но образы и эмоции сохраняются. Тень уходит. Ты сохранил визуальную память, но потерял словесную.\n\nКонец сцены.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 2",
                        "next": "Глава 2:start"
                    }
                }
            },
            "give_joy": {
                "text": "Однажды ты просыпаешься и не чувствуешь того простого тепла, что раньше наполняло твое сердце. Праздники — пустые даты. Но тень укоротила свой клык и ушла. Ты выжил, но платой стали цвета мира.\n\nКонец сцены.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 2",
                        "next": "Глава 2:start"
                    }
                }
            },
            "give_language": {
                "text": "Слова утекают. Твои междометия становятся странными. Ты помнишь смысл, но не привычные сочетания. Это странно и одиноко. Тень уходит, но память о детстве осталась дырявой.\n\nКонец сцены.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 2",
                        "next": "Глава 2:start"
                    }
                }
            },
            "burn_page": {
                "text": "Когда ты поджигаешь страницу, тепло распространяется по комнате. Пламя пожирает чернила и слова. С другой стороны что-то громко вздохнуло. Пламя не тушится обычной водой. Ты чувствуешь, что уничтожил не просто запись, а часть механизма, который держал этот дом. Пол под ногами зашатался.\n\nРешай быстро.",
                "buttons": {
                    "escape_room": {
                        "text": "Вырваться из комнаты",
                        "next": "enter_corridor"
                    },
                    "extinguish": {
                        "text": "Потушить пламя",
                        "next": "extinguish_fire"
                    }
                }
            },
            "break_cylinder": {
                "text": "Цилиндр раскалывается с металлическим скрежетом. Внутри — тонкая плёнка с записью. На ней кадры: красное небо, которое говорилось в записке, и бутылка с жидкостью, сияющей как лава. Немедленно комната наполняется шорохом. Похоже, ты активировал что-то, что лучше было не трогать.\n\nДействие привело к необратимому. Конец главы.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 2",
                        "next": "Глава 2:start"
                    }
                }
            },
            "tear_note": {
                "text": "Ты разрываешь бумагу и разбрасываешь клочки. Тень не реагирует сразу, но спустя несколько минут клочки начинают собираться в центр комнаты. Они образуют символ снова. Кажется, записка была фитилём. Теперь что-то разгорается в глубине дома.\n\nВыход один — идти дальше.",
                "buttons": {
                    "go_corridor": {
                        "text": "Выбежать в коридор",
                        "next": "open_door"
                    }
                }
            },
            "call_for_help": {
                "text": "Твой крик тонет в толще камня. Вместо ответа раздаются шаги, которые замедляются и останавливаются на расстоянии. Затем тишина. Не человек. Не зверь. Тишина, которая словно слушает. Ничего не происходит. Тогда появляется мысль: можешь ли ты позволить себе молчание как оружие?\n\nВыбор за тобой.",
                "buttons": {
                    "stay_silent": {
                        "text": "Замереть и ждать",
                        "next": "stay_silent"
                    },
                    "move_quietly": {
                        "text": "Двигаться тихо",
                        "next": "inspect_table"
                    }
                }
            },
            "stay_silent": {
                "text": "Ты замер. Время течёт медленно. Тени предостерегают друг друга шёпотом. Наконец голос, похожий на шелест листьев, произносит твоё имя, но не по-человечески. Голос уходит. Ты жив и получил время. Но цена — неизвестна.\n\nДальше — коридор.",
                "buttons": {
                    "go_corridor": {
                        "text": "Выйти в коридор",
                        "next": "enter_corridor"
                    }
                }
            },
            "follow_traces": {
                "text": "Следы ведут в комнату с зеркалами. Зеркала покрыты слоем пыли. В одном из них ты видишь отражение, которое не совпадает с твоим движением: оно задерживается, отстаёт и улыбается. В зеркале — дверь во внешний мир, но она закрыта. Ты понимаешь, что отражение живёт собственной жизнью.\n\nЧто делать?",
                "buttons": {
                    "smash_mirror": {
                        "text": "Разбить зеркало",
                        "next": "smash_mirror"
                    },
                    "talk_to_reflection": {
                        "text": "Попробовать заговорить с отражением",
                        "next": "talk_to_reflection"
                    },
                    "leave_traces": {
                        "text": "Вернуться назад",
                        "next": "enter_corridor"
                    }
                }
            },
            "smash_mirror": {
                "text": "Разбитие зеркала не освобождает тебя. Оно высвобождает только больше фрагментов. Осколки отражают разные версии тебя: усталую, молодую, испуганную. Один осколок показывает то самое красное небо. Осколки начинают медленно дрожать, как будто внутри льда течёт лава.\n\nПоследствия серьёзны. Конец главы.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 2",
                        "next": "Глава 2:start"
                    }
                }
            },
            "talk_to_reflection": {
                "text": "Отражение отвечает тихо. Его голос — твой голос, но вытянутый, как тень. Оно предлагает сделку: память за свободу. Ты предлагаешь условия. Разговор открывает путь: в отражении есть ключ к двери во внешний мир. Но цену отражение назовёт позже.\n\nВыбор: согласиться на сделку или искать другой выход.",
                "buttons": {
                    "agree_deal": {
                        "text": "Согласиться на сделку",
                        "next": "agree_deal"
                    },
                    "refuse_deal": {
                        "text": "Отказаться",
                        "next": "refuse_deal"
                    }
                }
            },
            "agree_deal": {
                "text": "Ты соглашаешься. Отражение тянет руку сквозь стекло. Холод проходит через запястье. Что-то сжимается внутри тебя. Ты чувствуешь, что отдаёшь фрагмент детства. Взамен отражение обещает открыть дверь. Но потом оно шепчет: «Иногда дверь открывает не выход, а взгляд назад». Ты получаешь ключ из отражения.\n\nКонец главы.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 2",
                        "next": "Глава 2:start"
                    }
                }
            },
            "refuse_deal": {
                "text": "Отказ. Отражение смеётся — тихо и болезненно. Оно исчезает, и ты остаёшься с осколками. Некоторые из них начинают шептать имена. Твои нервы на пределе. Но отказ сохраняет часть тебя. Это тоже выбор.\n\nКонец главы.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 2",
                        "next": "Глава 2:start"
                    }
                }
            },
            "call_back": {
                "text": "Ты окликаешь голос. Эхо возвращается и превращается в ритм. Шаги ускоряются. Из темноты появляется фигура, искажённая и то ли человеческая, то ли нет. Она подходит и молчит. В руке у неё — старый фонарь, дающий холодный свет. Она смотрит прямо на тебя, но глаза пусты.\n\nЭто встреча. Как реагировать?",
                "buttons": {
                    "approach_figure": {
                        "text": "Подойти ближе",
                        "next": "approach_figure"
                    },
                    "run_away": {
                        "text": "Убежать",
                        "next": "run_away"
                    }
                }
            },
            "approach_figure": {
                "text": "Фигура не двигается, но её присутствие давит. Она протягивает руку. На ладони — маленькая шкатулка. Когда ты её берёшь, шкатулка открывается, и внутри — стеклянный пузырёк с чернотой, которая не отражает свет. Фигура растворяется. Похоже, ты получил предмет.\n\nЧто делать с шкатулкой?",
                "buttons": {
                    "keep_box": {
                        "text": "Унести шкатулку",
                        "next": "keep_box"
                    },
                    "open_box_now": {
                        "text": "Открыть шкатулку",
                        "next": "open_box_now"
                    }
                }
            },
            "run_away": {
                "text": "Ты бежишь. Коридор меняется, как будто строится заново. Тени прилипают к ногам. Ты выбегаешь на лестницу и находишь дверь, которую раньше не заметил. За ней — свежий воздух и запах травы. Возможно, выход. Но дверь захлопывается за тобой, и ты оказываешься в другом саду, не в том, который помнишь.\n\nКонец главы — выбор повлияет на следующую.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 2",
                        "next": "Глава 2:start"
                    }
                }
            },
            "keep_box": {
                "text": "Шкатулка в твоих руках греется. Чернота внутри кажется глубоким колодцем. Иногда ты слышишь тонкий голос, если приложишь ухо. Голос называет даты и просит, чтобы ты отпустил что-то. Это опасно, но может быть и инструмент.\n\nПереход к следующей главе.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 2",
                        "next": "Глава 2:start"
                    }
                }
            },
            "open_box_now": {
                "text": "Ты открываешь шкатулку. Из неё вырывается густая тьма, и на пару секунд весь мир перестаёт быть устойчивым. Тебя тянет в этот вакуум. Ты едва успеваешь захлопнуть крышку. Шкатулка больше не даёт тепла. Она молчит.\n\nПоследствия перевернуты. Конец главы.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 2",
                        "next": "Глава 2:start"
                    }
                }
            },
            "extinguish_fire": {
                "text": "Ты тушишь пламя руками. Чернила остаются на коже. Тепло уходит, но запах гари остаётся. Где-то глубже в доме что-то замолкает, как будто вздохнуло. Ты остался с ожогом памяти и чувством, что закрыл одну дверь, но открыл другую.\n\nКонец главы.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 2",
                        "next": "Глава 2:start"
                    }
                }
            }
        },
        "Глава 2": {
            "start": {
                "text": "Ты выходишь на улицу, но это не тот мир, который ты помнишь. Город искажён: улицы текут как каналы, здания наклонены, а на горизонте возвышается конструкция, похожая на решётку из костей. Люди здесь ходят как тени, не глядя друг на друга. За каждым углом свистит ветер, несущий чужие слова.\n\nТвоя задача — найти сведения о том красном небе, которое упоминалось в записи. Где искать?",
                "buttons": {
                    "ask_local": {
                        "text": "Спросить прохожего",
                        "next": "ask_local"
                    },
                    "search_library": {
                        "text": "Идти в библиотеку",
                        "next": "search_library"
                    },
                    "follow_structure": {
                        "text": "Направиться к решётке на горизонте",
                        "next": "approach_grate"
                    }
                }
            },
            "ask_local": {
                "text": "Прохожий выглядит опустошённым. Он отвечает монотонно: «Небо приходило однажды. Некоторые заперлись в домах. Некоторые вышли, чтобы посмотреть. Те, кто вышел, говорили, что цвета горят и не дают дышать». Он указывает на знак на стене: символ круга с тремя лучами.\n\nСлова наводят на мысль, что место твоего дома не случайно. Решай.",
                "buttons": {
                    "follow_hint": {
                        "text": "Пойти по знаку",
                        "next": "follow_sign"
                    },
                    "press_for_more": {
                        "text": "Спросить еще",
                        "next": "press_for_more"
                    }
                }
            },
            "search_library": {
                "text": "Библиотека огромна и пахнет старой кожей. Книги лежат в беспорядке. В лото одна книга называется \"Записи о Переходе\". Ты находишь дневники исследователей, описывающих красное небо как явление, связанное с потерей памяти и искажением времени. Один фрагмент говорит о «плате воспоминанием».\n\nЗнание — это рычаг. Что делать?",
                "buttons": {
                    "copy_entry": {
                        "text": "Сделать копию записи",
                        "next": "copy_entry"
                    },
                    "look_for_map": {
                        "text": "Искать карту",
                        "next": "look_for_map"
                    },
                    "leave_library": {
                        "text": "Уйти из библиотеки",
                        "next": "approach_grate"
                    }
                }
            },
            "approach_grate": {
                "text": "Чем ближе, тем сильнее ощущение неправды. Решётка напоминает хребет. В её тени люди пропускают друг друга как волны. На самой решётке закреплены таблички с именами и датами. Некоторые таблички пусты. Ты видишь своё имя с опечаткой — знак совпадает.\n\nЧто предпринять?",
                "buttons": {
                    "climb_grate": {
                        "text": "Залезть на решётку",
                        "next": "climb_grate"
                    },
                    "read_plaques": {
                        "text": "Читать таблички",
                        "next": "read_plaques"
                    },
                    "walk_away": {
                        "text": "Уйти прочь",
                        "next": "walk_away"
                    }
                }
            },
            "follow_sign": {
                "text": "Знак ведёт к небольшому дворику, где собрались люди с закрытыми глазами. Они делают ритуал: складывают предметы — фото, игрушки, письма — в пазы в стене. Каждый раз, когда паз наполняется, свет кажется слабее. Один из участников кивает тебе и говорит: «Если хочешь спасти себя — отдай то, что держит тебя здесь».\n\nРешение за тобой.",
                "buttons": {
                    "join_ritual": {
                        "text": "Присоединиться к ритуалу",
                        "next": "join_ritual"
                    },
                    "refuse_ritual": {
                        "text": "Отказаться",
                        "next": "refuse_ritual"
                    }
                }
            },
            "press_for_more": {
                "text": "Когда ты настаиваешь, прохожий чуть оживает и шепчет: «Они приходят на рассвете. Красное небо — вьюга памяти. Берегись зеркал и коробок. В них смерть прячется, как дом в руинах». Его глаза пусты, но рука указывает на юг — туда, где стоят старые электростанции.\n\nКуда пойдёшь?",
                "buttons": {
                    "go_to_power": {
                        "text": "Пойти к электростанциям",
                        "next": "go_to_power"
                    },
                    "go_library": {
                        "text": "Идти в библиотеку",
                        "next": "search_library"
                    }
                }
            },
            "copy_entry": {
                "text": "Ксерокопия в твоих руках. Страница содержит фрагмент: «Когда небо горит, хранящиеся имена становятся валютой. Держать память — значит держать свет. Отдать память — значит позволить свету пройти». Это объясняет многое. Но дает мало практики. Тебе нужен план.\n\nДальше.",
                "buttons": {
                    "make_plan": {
                        "text": "Составить план действий",
                        "next": "make_plan"
                    },
                    "show_copy_to_someone": {
                        "text": "Показать записи прохожему",
                        "next": "show_copy_to_someone"
                    }
                }
            },
            "look_for_map": {
                "text": "Карта трёх годов указывает на три места: библиотека, решётка и старый маяк. Маяк помечен как «место хранения огня». Возможно, ответ на красное небо связан с маяком. Но маяк стоит за рекой, и мост разрушен.\n\nКуда направиться?",
                "buttons": {
                    "go_mayak": {
                        "text": "Идти к маяку",
                        "next": "go_mayak"
                    },
                    "return_grate": {
                        "text": "Вернуться к решётке",
                        "next": "approach_grate"
                    }
                }
            },
            "join_ritual": {
                "text": "Ты вкладываешь предмет в паз. На мгновение мир дрогнул. Твои воспоминания о том предмете исчезли, но стены двора прояснились. Люди вокруг тебя плачут не от печали, а от облегчения. Они благодарят тебя. Но в твоей голове осталась дыра.\n\nЦена уплачена. Что дальше?",
                "buttons": {
                    "ask_more": {
                        "text": "Спросить о механизме",
                        "next": "ask_more"
                    },
                    "leave_after": {
                        "text": "Уйти",
                        "next": "approach_grate"
                    }
                }
            },
            "refuse_ritual": {
                "text": "Отказ принимает форму одиночества. Люди отправляют на тебя косые взгляды. Кто-то шепчет, что ты принесёшь беду. Но отказ оставляет тебя целым. Ты всё ещё можешь попытаться найти иной путь к разгадке.\n\nПродолжай.",
                "buttons": {
                    "go_library": {
                        "text": "Идти в библиотеку",
                        "next": "search_library"
                    },
                    "go_mayak": {
                        "text": "Идти к маяку",
                        "next": "go_mayak"
                    }
                }
            },
            "climb_grate": {
                "text": "На вершине решётки вид открывается: город как паутина, а за ним — поле с выжженными деревьями. Где-то там, вдали, стена света слабо пульсирует. На верхушке решётки ты находишь записку: «Они закрывают небо, чтобы забрать то, что тепло хранит. Найди машину, что делает звук моря — она покажет путь».\n\nПодсказка доставлена. Куда идти?",
                "buttons": {
                    "search_machine": {
                        "text": "Искать машину со звуком моря",
                        "next": "search_machine"
                    },
                    "descend": {
                        "text": "Спуститься и идти к маяку",
                        "next": "go_mayak"
                    }
                }
            },
            "read_plaques": {
                "text": "Таблички перечисляют имена и события. Некоторые имена зачёркнуты. Под одним табличкой написано мелкими буквами: «Хранитель света — в машине на башне. Не давайте тени доступ».\n\nИнформация ключевая. Действуй.",
                "buttons": {
                    "go_to_tower": {
                        "text": "Искать башню с машиной",
                        "next": "go_to_tower"
                    },
                    "return_city": {
                        "text": "Вернуться в город",
                        "next": "start"
                    }
                }
            },
            "walk_away": {
                "text": "Ты отходишь, но чувство наблюдения не отпускает. За спиной слышится тихий звон. Кажется, решётка реагирует на твое отступление. Иногда правильный выбор — уход. Но иногда уход оставляет нерешённые проблемы.\n\nГлава продолжается.",
                "buttons": {
                    "go_library": {
                        "text": "Пойти в библиотеку",
                        "next": "search_library"
                    },
                    "go_mayak": {
                        "text": "Идти к маяку",
                        "next": "go_mayak"
                    }
                }
            },
            "go_to_power": {
                "text": "Электростанции стоят мёртво. Внутри одна из машин издает монотонный звук, похожий на прибой. На панели — рычаги и таблички. Одна кнопка помечена словом «Память». Когда ты активируешь прибор, на экранах мелькают лица, которые ты потерял. Машина может вернуть тебе фрагмент воспоминаний. Но каждое восстановление увеличит силу тени.\n\nРешай: восстановить или нет?",
                "buttons": {
                    "restore_memory": {
                        "text": "Включить и восстановить память",
                        "next": "restore_memory"
                    },
                    "leave_power": {
                        "text": "Уйти от станции",
                        "next": "approach_grate"
                    }
                }
            },
            "go_mayak": {
                "text": "Маяк стоит на краю воды. Его верхушка разбита, но внизу слышен тот самый звук — ритм моря. У основания маяка ты находишь древний механизм. Он соединён с сетью стеклянных колб, внутри которых светится нечто похожее на кровь. На стене — надпись: «Свет кормится воспоминаниями. Храните свои якоря».\n\nТут можно починить механизм или осмотреть берег.",
                "buttons": {
                    "repair_mechanism": {
                        "text": "Попытаться починить механизм",
                        "next": "repair_mechanism"
                    },
                    "search_shore": {
                        "text": "Осмотреть берег",
                        "next": "search_shore"
                    }
                }
            },
            "search_machine": {
                "text": "Ты находишь машину в старой радиовышке. Она издает запись: звук моря, записанный многократно, и в конце голос, говорящий: «Храните якоря, чтобы не улететь в небо». Рядом — команда: «Параметр: отдача памяти = 1 единица на цикл».\n\nПонимание приходит: контроль отдачи памяти регулирует свет в небе. Ты можешь вмешаться.",
                "buttons": {
                    "adjust_parameter": {
                        "text": "Изменить параметр отдачи",
                        "next": "adjust_parameter"
                    },
                    "destroy_machine": {
                        "text": "Уничтожить машину",
                        "next": "destroy_machine"
                    }
                }
            },
            "search_shore": {
                "text": "На берегу ты находишь плоты и старые фотографии, привязанные к камням. На одной фотографии — дом из твоих воспоминаний, но искажённый. Кто-то сюда приходил и оставлял память в виде записок, привязанных к реальности. Возможно, если сшить эти нити, можно вернуть нормальное небо.\n\nДействуй.",
                "buttons": {
                    "collect_photos": {
                        "text": "Собрать фотографии",
                        "next": "collect_photos"
                    },
                    "follow_plots": {
                        "text": "Запустить плот",
                        "next": "launch_raft"
                    }
                }
            },
            "repair_mechanism": {
                "text": "Твои руки работают быстро. Ты подпаиваешь провод, и механизм загудел ровнее. Свет в колбах усилился. Однако в тот же момент вдалеке небо начинает слабеть и на месте горизонта появляется тонкая рваная полоса красного. Вдруг к тебе подходит женщина в плаще и говорит: «Ты починил шлюз. Но кто его кормит?»\n\nКого винить?",
                "buttons": {
                    "blame_ritual": {
                        "text": "Сказать, что виноваты ритуалы горожан",
                        "next": "blame_ritual"
                    },
                    "blame_machines": {
                        "text": "Сказать, что виноваты машины",
                        "next": "blame_machines"
                    }
                }
            },
            "collect_photos": {
                "text": "Фотографии в твоих руках дают ключевые фрагменты. Складывая их в определённом порядке, ты восстанавливаешь цепочку событий: раньше люди заключали сделки с тенью, отдавая прошлое за свет. Теперь некоторые сожалеют. Ты можешь использовать фотографии, чтобы убедить людей прекратить ритуалы.\n\nВыбери тактику.",
                "buttons": {
                    "convince_people": {
                        "text": "Убедить людей прекратить ритуалы",
                        "next": "convince_people"
                    },
                    "use_photos_to_trade": {
                        "text": "Использовать фото как плату",
                        "next": "use_photos_to_trade"
                    }
                }
            },
            "launch_raft": {
                "text": "Плот унесёт тебя туда, где берег кончается и начинается поле искривлённого света. По пути видишь мерцающие формы под водой. Они тянутся к поверхности, словно ищут память. Путь опасен, но может привести к хранилищу света.\n\nПриключение продолжается.",
                "buttons": {
                    "land_on_island": {
                        "text": "Высадиться на острове со строением",
                        "next": "island_ruins"
                    },
                    "return_shore": {
                        "text": "Вернуться на берег",
                        "next": "go_mayak"
                    }
                }
            },
            "adjust_parameter": {
                "text": "Ты уменьшаешь отдачу. Свет на горизонте ослабевает. Горожане ощущают облегчение. Но это только временная мера. Машина сопротивляется. На экране появляются предупреждения: «Стабильность нарушена. Последствия неизвестны».\n\nРеши окончательно: остановить машину или восстановить работу.",
                "buttons": {
                    "stop_machine": {
                        "text": "Остановить машину",
                        "next": "stop_machine"
                    },
                    "restore_default": {
                        "text": "Восстановить прежние параметры",
                        "next": "restore_default"
                    }
                }
            },
            "destroy_machine": {
                "text": "Ты ломишь механизм. Это вызывает мгновенные толчки в пространстве. Небо рвётся ярче. Тени вокруг становятся агрессивнее. Возможно, уничтожение машины ускорит конец, но даст шанс новой реальности появиться.\n\nКонец главы, последствия в следующей.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 3",
                        "next": "Глава 3:start"
                    }
                }
            },
            "restore_memory": {
                "text": "Машина возвращает тебе фрагмент прошлого. Ты снова чувствуешь тепло, голос, который давно не слышал. Возвращение приносит слёзы облегчения. Но на дисплее станции появляется надпись: «Цена взята: 3% территории».\n\nКаждое восстановление ускоряет изменение мира. Поступай осторожно.",
                "buttons": {
                    "stop_restoration": {
                        "text": "Остановить восстановление",
                        "next": "approach_grate"
                    },
                    "continue_restoration": {
                        "text": "Продолжать",
                        "next": "continue_restoration"
                    }
                }
            },
            "make_plan": {
                "text": "План прост: собрать союзников, найти источник света и либо разрушить его, либо перенацелить. Но для этого нужны ресурсы: доказательства, инструменты и те, кто готов действовать. В твоих руках копия из библиотеки. Это начало.\n\nСледующие шаги?",
                "buttons": {
                    "gather_allies": {
                        "text": "Искать союзников",
                        "next": "gather_allies"
                    },
                    "go_alone": {
                        "text": "Пойти в одиночку",
                        "next": "go_mayak"
                    }
                }
            },
            "show_copy_to_someone": {
                "text": "Когда ты показываешь копию прохожему, он улыбается и шепчет: «Это правда. Я тоже помню, как было раньше». Он предлагает помощь. Похоже, есть люди, которые всё ещё помнят полноценное небо.\n\nНайти их — задача.",
                "buttons": {
                    "accept_help": {
                        "text": "Принять помощь",
                        "next": "gather_allies"
                    },
                    "decline_help": {
                        "text": "Отказаться и идти дальше",
                        "next": "go_mayak"
                    }
                }
            }
        },
        "Глава 3": {
            "start": {
                "text": "Последствия твоих действий отзываются эхом. Мир меняется. Небо всё чаще мерцает кроваво-красным. В одной из ночей появляется излом — прозрачная дверь в небо. Через неё проходят сущности, которые забирают воспоминания как еду. Ты ощущаешь ответственность. Теперь выбор — разрушить источник или попытаться договориться.\n\nДействуй.",
                "buttons": {
                    "seek_treaty": {
                        "text": "Пытаться договориться с сущностями",
                        "next": "seek_treaty"
                    },
                    "attack_source": {
                        "text": "Найти и уничтожить источник",
                        "next": "attack_source"
                    },
                    "hide_people": {
                        "text": "Помочь людям спрятать память",
                        "next": "hide_people"
                    }
                }
            },
            "seek_treaty": {
                "text": "Договариваться — опасно. Ты находишь проводника, который переводит тебя к существам. Они говорят без слов и требуют жертв. Ты предлагаешь другую цену: обмен знаний о том, как жить дальше. Существо соглашается, но предлагает сделку: оно вернёт часть памяти в обмен на архитектуру новой памяти — архив из людей, которые согласны стать хранителями. Это предложение может изменить общество навсегда.\n\nЧто выбираешь?",
                "buttons": {
                    "accept_archivists": {
                        "text": "Создать архив и согласиться",
                        "next": "accept_archivists"
                    },
                    "refuse_archivists": {
                        "text": "Отказаться и сражаться",
                        "next": "attack_source"
                    }
                }
            },
            "attack_source": {
                "text": "Атака будет кровавой. Источник — узел энергии, расположенный под старым театром. Ты собираешь команду или идёшь один. Взрывный эффект возможен. Но если ты победишь, многие воспоминания вернутся, и небо может изменить цвет навсегда.\n\nКак действовать?",
                "buttons": {
                    "assemble_team": {
                        "text": "Собрать команду",
                        "next": "assemble_team"
                    },
                    "go_alone_again": {
                        "text": "Идти самому",
                        "next": "solo_attack"
                    }
                }
            },
            "hide_people": {
                "text": "Ты находишь способ шифровать память: особые коробки, сделанные из солёного дерева и стекла, которые закрывают детали воспоминаний, оставляя эмоции. Это поможет людям пережить нашествие, но сохранит их личность частично разрушенной.\n\nТы выбираешь: распространять этот метод или нет.",
                "buttons": {
                    "spread_technique": {
                        "text": "Распространить технику маскировки",
                        "next": "spread_technique"
                    },
                    "keep_secret": {
                        "text": "Сохранить метод в секрете",
                        "next": "keep_secret"
                    }
                }
            },
            "accept_archivists": {
                "text": "Архив создаётся. Волонтёры приходят и отдают фрагменты своей памяти, чтобы сущности оставили людей в покое. Архив растёт. Некоторые благодарны. Некоторые говорят, что это предательство. Ты стоишь на грани нового устройства общества.\n\nЭпилог главы: будущее зависит от твоего выбора.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 4",
                        "next": "Глава 4:start"
                    }
                }
            },
            "assemble_team": {
                "text": "Твоя команда состоит из тех, кто сохранил память и тех, кто готов рисковать. Вместе вы проникаете под театр через старые подвалы. Ты ставишь взрывчатку и готовишься к отключению узла. Сигнал тревоги срывается, и начинаются схватки с тенями.\n\nБитва определит многое.",
                "buttons": {
                    "detonate": {
                        "text": "Подорвать узел",
                        "next": "detonate"
                    },
                    "sabotage_only": {
                        "text": "Саботировать систему, не разрушая полностью",
                        "next": "sabotage_only"
                    }
                }
            },
            "solo_attack": {
                "text": "Один шаг, один рывок. Ты проникаешь в сердце узла. Вокруг вибрируют голоса. Ты чувствуешь, как поток памяти бежит через твои пальцы. Выбора немного: либо ты разрушишь всё и потеряешь часть себя, либо спасёшь часть мира ценой собственной памяти.\n\nВыбор непростой.",
                "buttons": {
                    "sacrifice_memory": {
                        "text": "Отдать свою память, чтобы обрушить узел",
                        "next": "sacrifice_memory"
                    },
                    "destroy_with_memory": {
                        "text": "Уничтожить узел силой, сохранив память другого",
                        "next": "destroy_with_memory"
                    }
                }
            },
            "detonate": {
                "text": "Взрыв сотрясает землю. Небо рвётся, и сначала кажется, что всё кончено — но затем память, которую забирали сущности, возвращается с волной. Люди плачут. Некоторые захвачены собственными воспоминаниями. Цена велика: несколько городских районов остаются навсегда искаженными.\n\nИсход зависит от того, что будет дальше.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 4",
                        "next": "Глава 4:start"
                    }
                }
            },
            "sabotage_only": {
                "text": "Саботаж дает шанс: узел повреждён, но не уничтожен. Существа теряют контроль, но не сдаются. Мир начинает медленную реабилитацию. Ты и твоя команда остаетесь с грузом ответственности: что делать с полупочинённым узлом?\n\nГотовься к следующей фазе.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 4",
                        "next": "Глава 4:start"
                    }
                }
            },
            "sacrifice_memory": {
                "text": "Ты отдаёшь себе воспоминания добровольно. Это болезненно. Узел рушится, тьма отступает. Мир меняется. Ты пережил личную потерю ради многих. Так создаются легенды, но и пустота в твоём сервере душевных карт будет ощущаться вечно.\n\nЭпилог глубок и горькое. Конец главы.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 4",
                        "next": "Глава 4:start"
                    }
                }
            },
            "destroy_with_memory": {
                "text": "Ты пытаешься уничтожить узел, направляя отблески воспоминаний других в механизм. Узел падает, но ценой того, что некоторые люди теряют обрывки — ради больших масштабов спасения. Выбор спорный, но мир остаётся жив.\n\nДальше — последствия.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 4",
                        "next": "Глава 4:start"
                    }
                }
            },
            "spread_technique": {
                "text": "Твоя техника помогает многим. Город адаптируется: люди учатся запечатывать болезненные детали, оставляя эмоции и связи. Мир меняется, но не полностью. Тень ищет новые пути.\n\nБудущее неопределённо.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 4",
                        "next": "Глава 4:start"
                    }
                }
            },
            "keep_secret": {
                "text": "Секрет хранится, и ты сохраняешь власть. Но многие упустят шанс. Ты остался с инструментом, который можно использовать и злоупотребить. Ответственность — тяжеловес.\n\nСледующая глава.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 4",
                        "next": "Глава 4:start"
                    }
                }
            },
            "assemble_team": {
                "text": "Команда подобрана: механик, бывший библиотекарь, и женщина, что знает ритуалы. Вместе вы имеете шансы. Но доверие — хрупкая валюта. Перед атакой необходимо распределить роли.\n\nРаспределяешь задачи или проверяешь ещё раз оборудование?",
                "buttons": {
                    "assign_roles": {
                        "text": "Распределить роли",
                        "next": "assign_roles"
                    },
                    "double_check": {
                        "text": "Проверить оборудование ещё раз",
                        "next": "double_check"
                    }
                }
            }
        },
        "Глава 4": {
            "start": {
                "text": "Мир после удара меняется медленно. Люди возвращаются к привычкам, но тень все ещё шевелится в углах. Архивы растут, технологии адаптированы, и похоже, что начался долгий процесс восстановления. Но появляется новая угроза: идея, что память можно продать за комфорт, начинает распространяться как бизнес.\n\nТы стоишь перед выбором: создать правила или позволить рынку решать.",
                "buttons": {
                    "create_policy": {
                        "text": "Создать общественные правила обращения с памятью",
                        "next": "create_policy"
                    },
                    "let_market": {
                        "text": "Позволить частным лицам торговать памятью",
                        "next": "let_market"
                    },
                    "guard_archive": {
                        "text": "Стань защитником архива",
                        "next": "guard_archive"
                    }
                }
            },
            "create_policy": {
                "text": "Политика вводится. Комиссия решает: память — общественное достояние. Это вызывает протесты и поддержку. В результате появляются новые институты и школа архивистов. Но не все согласны. Контроверзии продолжаются.\n\nДальше.",
                "buttons": {
                    "implement_rules": {
                        "text": "Воплощать правила в жизнь",
                        "next": "implement_rules"
                    },
                    "step_down": {
                        "text": "Уйти на задний план",
                        "next": "step_down"
                    }
                }
            },
            "let_market": {
                "text": "Рынок разворачивается быстро. Память становится товаром. Люди платят за забывание обид и покупают воспоминания, чтобы почувствовать красоту жизни. Но общественные разрывы растут. Некоторые богатеют, некоторые теряют всё. Ты наблюдаешь за этим и осознаёшь: свобода приобретает свою цену.\n\nЭта дорога приводит к дальнейшим конфликтам.",
                "buttons": {
                    "fight_market": {
                        "text": "Бороться с коммерциализацией",
                        "next": "fight_market"
                    },
                    "adapt_with_market": {
                        "text": "Адаптироваться и использовать возможности",
                        "next": "adapt_with_market"
                    }
                }
            },
            "guard_archive": {
                "text": "Ты берёшь на себя роль стража архива. Твоя задача — сохранять целостность: не позволять манипулировать памятью. Это задача на всю жизнь. Ты учишь других, как хранить, как шифровать и как отдавать по необходимости.\n\nЭпилог: долгий и спокойный путь.",
                "buttons": {
                    "next_chapter": {
                        "text": "Перейти к Главе 5",
                        "next": "Глава 5:start"
                    }
                }
            },
            "implement_rules": {
                "text": "Правила не идеальны, но дают структуру. Ты работаешь над механизмом: кто решает, кто хранит, кто восстанавливает. Иногда приходится принимать суровые решения. Но общество становится более устойчивым.\n\nПродолжай.",
                "buttons": {
                    "enforce_rules": {
                        "text": "Осуществлять контроль и правоприменение",
                        "next": "enforce_rules"
                    },
                    "educate_public": {
                        "text": "Обучать людей новым практикам",
                        "next": "educate_public"
                    }
                }
            }
        },
        "Глава 5": {
            "start": {
                "text": "Годы идут. Небо больше не рвётся так часто. Люди приспосабливаются. Новые поколения растут с иными понятиями памяти и приватности. В то же время твоя личная история — пустая полоса, если ты отдавал воспоминания ради спасения. Иногда ты находишь вещи, которые старые друзья не узнают в тебе. Ты принимаешь это как цену.\n\nОставшиеся вопросы: можно ли вернуть всё и стоит ли это делать?",
                "buttons": {
                    "attempt_full_restore": {
                        "text": "Попытаться полностью восстановить прошлое",
                        "next": "attempt_full_restore"
                    },
                    "accept_new_world": {
                        "text": "Принять новый мир и жить дальше",
                        "next": "accept_new_world"
                    },
                    "search_lost_face": {
                        "text": "Искать потерянное лицо",
                        "next": "search_lost_face"
                    }
                }
            },
            "attempt_full_restore": {
                "text": "Полное восстановление требует огромной цены. Машины, ритуалы и архивы должны объединиться. Возрождение прошлого может положить конец тени, но оно может и разрушить тонкую ткань новой жизни. Ты стоишь перед выбором: рискнуть всем или оставить достижения такими, какие они есть.\n\nРеши окончательно.",
                "buttons": {
                    "risky_restore": {
                        "text": "Рискнуть и восстановить полностью",
                        "next": "risky_restore"
                    },
                    "let_be": {
                        "text": "Оставить как есть",
                        "next": "accept_new_world"
                    }
                }
            },
            "search_lost_face": {
                "text": "Ты ищешь лицо, которое потерял. Где оно может быть? В архивах, в коробках, в чьих-то словах. Поиск даёт частичные успехи: фрагменты, запахи, музыкальные отрезки. Но целого нет. Возможно, некоторые вещи безвозвратны.\n\nЧто делать с фрагментами?",
                "buttons": {
                    "assemble_fragment": {
                        "text": "Собрать фрагменты в коллаж",
                        "next": "assemble_fragment"
                    },
                    "bury_it": {
                        "text": "Похоронить поиск и уйти",
                        "next": "accept_new_world"
                    }
                }
            }
        },
        "Глава 6": {
            "start": {
                "text": "Финал. Мир выбрать теперь иная траектория. Твои решения создали сети: школа архивистов, правила, подземные фирмы, и тех, кто борется. Небо стало менее хищным. Но есть один последний выбор, который определит, станет ли человечество свободным или покорится новой торговле воспоминаниями.\n\nВыбор и итог — за тобой.",
                "buttons": {
                    "final_choice_restore": {
                        "text": "Последний акт: восстановить прошлое ценой настоящего",
                        "next": "final_choice_restore"
                    },
                    "final_choice_rebuild": {
                        "text": "Перестроить общество на новых принципах",
                        "next": "final_choice_rebuild"
                    },
                    "final_choice_disappear": {
                        "text": "Признать невозможность и уйти в тень",
                        "next": "final_choice_disappear"
                    }
                }
            },
            "final_choice_restore": {
                "text": "Ты запускаешь процесс полного восстановления. На кону — память множества людей. Мир на мгновение вспыхивает, потом растворяется в ясности прошлого. Некоторые исчезают, найдя утешение в давно потерянных жизнях. Другие просыпаются в чужой реальности. Это победа и утрата одновременно.\n\nФинал: смешанный. Конец игры.",
                "buttons": {
                    "end": {
                        "text": "Конец",
                        "next": "end"
                    }
                }
            },
            "final_choice_rebuild": {
                "text": "Ты выбираешь долгую работу. Вместе с союзниками строишь институты, учишь людей сохранять важное, создавать ремесла памяти и моральные регламенты. Мир становится гибким и учится жить с потерями. Не героично, но честно.\n\nФинал: постепенное выздоровление. Конец игры.",
                "buttons": {
                    "end": {
                        "text": "Конец",
                        "next": "end"
                    }
                }
            },
            "final_choice_disappear": {
                "text": "Ты выбираешь исчезнуть. Уход в тень — не бегство, а наблюдение. Ты становишься хранителем редких артефактов, сторонним наблюдателем перемен. Мир продолжает жить без твоего прямого участия. Может быть, это лучший исход для некоторых.\n\nФинал: тихий уход. Конец игры.",
                "buttons": {
                    "end": {
                        "text": "Конец",
                        "next": "end"
                    }
                }
            }
        }
    }
}
